/* tbg_tbl5.c ---------------------------------------------------------------
                  Функции интерфейса Си с TBG-файлами

                    Графический пакет "ТурБоГрафика"
                      (C) Павельев П.И. 1990-95
---------------------------------------------------------------------------*/

#include "tbg_tc.h" /* обьявления функций и данных */

#include <string.h>
#include <stdlib.h>
#include <dir.h>
#include <io.h>

/*--------------------------------------------------------------------------*/
/* (C) Чумак А.И. 1992 */
/*--------------------------------------------------------------------------*/
void restore_tbl(void)
{
   if(Tbl_Present==No)
   {
      error_tbg = ER_SETLIB; /* файл библиотеки не установлен */
      return;
   }//if

   if(Tbl_Present==Hide){
      Tbl_Present=Ok;
      fd=fd_tmp;
   }//if
   else{
      error_tbg = ER_HIDELIB; /* уже скрыта библиотека */
   }//if else

}/* restore_tbl */
/*--------------------------------------------------------------------------*/