/* tbg_mou1.c ---------------------------------------------------------------
                  Функции интерфейса Си с TBG-файлами

                    Графический пакет "ТурБоГрафика"
                      (C) Павельев П.И. 1990-95
---------------------------------------------------------------------------*/

#include "tbg_tc.h" /* обьявления функций и данных */

#include <graphics.h>

/*--------------------------------------------------------------------------*/
/* (C) Павельев П.И. 1990-92 */
/*--------------------------------------------------------------------------*/
void mouse_on()
{
union REGS inregs;

 if(MouseSet == OFF) return;// 'мыши' нет
 inregs .x.ax=1; /* изобразить курсор "мыши"*/
 int86(0x33,&inregs,&inregs);

 if((mouse_mode != ABSENT) && (mouse_mode != MOUSE_DRAW)){
    mouse_mode = MOUSE_ON;
    mouse_draw();
 }/* if */

}
/*--------------------------------------------------------------------------*/