/* tbg_pren.c ---------------------------------------------------------------
                  Функции интерфейса Си с TBG-файлами

                    Графический пакет "ТурБоГрафика"
                      (C) Павельев П.И. 1990-95
---------------------------------------------------------------------------*/

#include "tbg_tc.h" /* обьявления функций и данных */

/*--------------------------------------------------------------------------*/
/* (C) Павельев П.И. 1993 */
/*--------------------------------------------------------------------------*/
// попадание в элемент обьекта
short int pren(OBJECT **pic,short int obj,short int num,short int x,short int y)
{
 short int xmin, ymin, xmax, ymax;

 getsize_obj_num(pic,obj,num,&xmin,&ymin,&xmax,&ymax);

 if((x >= xmin)&&
    (x <= xmax)&&
    (y >= ymin)&&
    (y <= ymax))  return ON;/* принадлежит */
    return OFF;/* не пренадлежит */

}/* pren */
/*--------------------------------------------------------------------------*/