/* tbg_mou8.c ---------------------------------------------------------------
                  Функции интерфейса Си с TBG-файлами

                    Графический пакет "ТурБоГрафика"
                      (C) Павельев П.И. 1990-95
---------------------------------------------------------------------------*/

#include "tbg_tc.h" /* обьявления функций и данных */

#include <graphics.h>

/*--------------------------------------------------------------------------*/
/* (C) Чумак А.И. 1990-92 */
/*--------------------------------------------------------------------------*/
void mouse_mask(unsigned short int *mask,char of_column,char of_line)
{

   union REGS reg,outr;
   struct SREGS segregs;

   reg.x.ax=0x0009;
   reg.x.bx=(short int)of_column;
   reg.x.cx=(short int)of_line;
   reg.x.dx  =FP_OFF(mask);
   segregs.es=FP_SEG(mask);
   int86x(0x33,&reg,&outr,&segregs);

}//mouse_mask
/*--------------------------------------------------------------------------*/