/* tbg_mou7.c ---------------------------------------------------------------
                  Функции интерфейса Си с TBG-файлами

                    Графический пакет "ТурБоГрафика"
                      (C) Павельев П.И. 1990-95
---------------------------------------------------------------------------*/

#include "tbg_tc.h" /* обьявления функций и данных */

#include <graphics.h>

/*--------------------------------------------------------------------------*/
/* (C) Павельев П.И. 1990-92 */
/*--------------------------------------------------------------------------*/
/* Были ли отпускания с момента последнего вызова функции
   'last release key' */
void mouse_lrk(short int *left,short int *right)
{
union REGS inregs;

 if(MouseSet == OFF) {
    (*left) =0;
    (*right)=0;
    return;/* 'мыши' нет */
 }/* if */

 inregs .x.ax=6;
 inregs .x.bx=0;/* 0-левая; 1-правая кнопка */
 int86(0x33,&inregs,&inregs);
/*
 if(lpress_lb)/* была эмуляция нажатия */
 {  lpress_lb=0;
    (*left)=1;
 }/* if */
 else (*left) =inregs.x.bx;
*/
 (*left) =inregs.x.bx;

 inregs .x.ax=6;
 inregs .x.bx=1;/* 0-левая; 1-правая кнопка */
 int86(0x33,&inregs,&inregs);
/*
 if(lpress_rb)/* была эмуляция нажатия */
 {  lpress_rb=0;
    (*right)=1;
 }/* if */
 else (*right)=inregs.x.bx;
*/
 (*right)=inregs.x.bx;
}/* mouse_lrk */

/*--------------------------------------------------------------------------*/