/* tbg_mou4.c ---------------------------------------------------------------
                  Функции интерфейса Си с TBG-файлами

                    Графический пакет "ТурБоГрафика"
                      (C) Павельев П.И. 1990-95
---------------------------------------------------------------------------*/

#include "tbg_tc.h" /* обьявления функций и данных */

#include <graphics.h>

/*--------------------------------------------------------------------------*/
/* (C) Павельев П.И. 1990-92 */
/*--------------------------------------------------------------------------*/
/* Координаты 'мышa' в момент вызова функции
   current press key */
void mouse_getxy(short int *x,short int *y)
{
union REGS inregs;

 if(MouseSet == OFF) {
    (*x)  = 0;
    (*y)  = 0;
    return;// 'мыши' нет
 }// if

 inregs .x.ax = 3;
 int86(0x33,&inregs,&inregs);

 if(((GraphDriver==1  )||  //  Для CGA 320*200 4 цвета
     (GraphDriver==134)    //  Для VGA 320*200 256 цветов
    )&&
     (GraphMode==0)
   )
        (*x)  =(short int)((double)inregs.x.cx*(double)getmaxx()/638.);
   else (*x)  =inregs.x.cx;
        (*y)  =inregs.x.dx;
}/* mouse_getxy */
/*--------------------------------------------------------------------------*/