/* tbg_tbl4.c ---------------------------------------------------------------
                  Функции интерфейса Си с TBG-файлами

                    Графический пакет "ТурБоГрафика"
                      (C) Павельев П.И. 1990-95
---------------------------------------------------------------------------*/

#include "tbg_tc.h" /* обьявления функций и данных */

#include <string.h>
#include <stdlib.h>
#include <dir.h>
#include <io.h>

/*--------------------------------------------------------------------------*/
/* (C) Чумак А.И. 1992 */
/*--------------------------------------------------------------------------*/
void hide_tbl(void)
{

   if(Tbl_Present==Hide)
   {
      error_tbg = ER_HIDELIB;/* уже скрыта библиотека */
      return;
   }//if

   if(Tbl_Present==Ok){
      Tbl_Present=Hide;
      fd_tmp=fd;
      fd=(FILE*)NULL;
   }//if
   else{
      error_tbg = ER_SETLIB; /* файл библиотеки не установлен */
   }//if else

}//hide_tbl
/*--------------------------------------------------------------------------*/