/* tbg_tbl3.c ---------------------------------------------------------------
                  Функции интерфейса Си с TBG-файлами

                    Графический пакет "ТурБоГрафика"
                      (C) Павельев П.И. 1990-95
---------------------------------------------------------------------------*/

#include "tbg_tc.h" /* обьявления функций и данных */

#include <string.h>
#include <stdlib.h>
#include <dir.h>
#include <io.h>

/*--------------------------------------------------------------------------*/
/* (C) Чумак А.И. 1992 */
/*--------------------------------------------------------------------------*/
void unset_tbl(void)
{
   if(Tbl_Present==No)
   {
      error_tbg = ER_SETLIB; /* файл библиотеки не установлен */
      return;
   }//if

   free(pitDir);

   fclose(fd);
   Tbl_Present=No;
}/* unset_tbl */
/*--------------------------------------------------------------------------*/