/* tbg_dmxy.c ---------------------------------------------------------------
                  Функции интерфейса Си с TBG-файлами

                    Графический пакет "ТурБоГрафика"
                      (C) Павельев П.И. 1990-95
---------------------------------------------------------------------------*/

#include "tbg_tc.h" /* обьявления функций и данных */

#include <math.h>

/*--------------------------------------------------------------------------*/
/* (C) Павельев П.И. 1990-92 */
/*--------------------------------------------------------------------------*/
short int DMX(long x) /* приведение к экранным координатам */
{
 long tmp,t;

 t = x-(long)xa_min;
 tmp= (0.5 + ((double)labs(t)*(SX_vp / (double)size_xya)));

 if(t< 0L) return -(short int)tmp;
   else    return  (short int)tmp;
}/* DMx */
/*--------------------------------------------------------------------------*/
/* (C) Павельев П.И. 1990-92 */
/*--------------------------------------------------------------------------*/
short int DMY(long y) /* приведение к экранным координатам */
{
 long tmp,t;

 t = y-(long)ya_min;
 tmp= (0.5 + ((double)labs(t)*(SY_vp / (double)size_xya)));

 if(t< 0L) return -(short int)tmp;
   else    return  (short int)tmp;
}/* DMy */
/****************************************************************************/

/*--------------------------------------------------------------------------*/