/* tbg_mou2.c ---------------------------------------------------------------
                  Функции интерфейса Си с TBG-файлами

                    Графический пакет "ТурБоГрафика"
                      (C) Павельев П.И. 1990-95
---------------------------------------------------------------------------*/

#include "tbg_tc.h" /* обьявления функций и данных */

#include <graphics.h>

/*--------------------------------------------------------------------------*/
/* (C) Павельев П.И. 1990-92 */
/*--------------------------------------------------------------------------*/
void mouse_off()
{
union REGS inregs;

 if(MouseSet == OFF) return;// 'мыши' нет
 inregs .x.ax=2; /* убрать  курсор "мыши"*/
 int86(0x33,&inregs,&inregs);

 if(mouse_mode != ABSENT){
    mouse_mode = MOUSE_OFF;
    mouse_draw();
 }/* if */

}
/*--------------------------------------------------------------------------*/