/* tbg_bsy.c ---------------------------------------------------------------
                  Функции интерфейса Си с TBG-файлами

                    Графический пакет "ТурБоГрафика"
                      (C) Павельев П.И. 1990-95
                      (С) Чумак А. И. 1992-2002
---------------------------------------------------------------------------*/

#include "tbg_tc.h" /* обьявления функций и данных */

static int stateTBG = 0; // 0 - свободен
                         // 1 - занят
/*--------------------------------------------------------------------------*/
/* (C) Чумак А.И. 2002 */
/*--------------------------------------------------------------------------*/
int getstateTBG(OBJECT **obj){
     return (obj) ? ((struct HTBG*)*(obj))->busy : 0;
}/* getststeTBG */
/*--------------------------------------------------------------------------*/
void setstateTBG(OBJECT **obj, int sstate){
  if((obj) && ((sstate == 0) || (sstate == 1)))
     ((struct HTBG*)*(obj))->busy = sstate;
}/* getststeTBG */
/*--------------------------------------------------------------------------*/
