/* tbg_mou3.c ---------------------------------------------------------------
                  Функции интерфейса Си с TBG-файлами

                    Графический пакет "ТурБоГрафика"
                      (C) Павельев П.И. 1990-95
---------------------------------------------------------------------------*/

#include "tbg_tc.h" /* обьявления функций и данных */

#include <graphics.h>

/*--------------------------------------------------------------------------*/
/* (C) Павельев П.И. 1990-92 */
/*--------------------------------------------------------------------------*/
void mouse_setxy(short int x,short int y)
{
union REGS inregs;

 if(MouseSet == OFF) return;// 'мыши' нет

 inregs .x.ax=4;
 inregs .x.cx=x;
 inregs .x.dx=y;
 int86(0x33,&inregs,&inregs);
 if(mouse_mode != ABSENT){
    mouse_draw();
 }/* if */
}/* mouse_setxy */
/*--------------------------------------------------------------------------*/