/* tbg_mou5.c ---------------------------------------------------------------
                  Функции интерфейса Си с TBG-файлами

                    Графический пакет "ТурБоГрафика"
                      (C) Павельев П.И. 1990-95
---------------------------------------------------------------------------*/

#include "tbg_tc.h" /* обьявления функций и данных */

#include <graphics.h>

/*--------------------------------------------------------------------------*/
/* (C) Павельев П.И. 1990-92 */
/*--------------------------------------------------------------------------*/
/* Нажаты ли кнопки в момент вызова функции
   current press key */
void mouse_cpk(short int *keys)
{
union REGS inregs;

 if(MouseSet == OFF) {
    (*keys) =0;
    return;// 'мыши' нет
 }// if

 inregs .x.ax=3;
 int86(0x33,&inregs,&inregs);
 if(cpress_lb && cpress_rb)/* была эмуляция нажатия */
 {  cpress_lb=cpress_rb=0;
    (*keys)=3;
    return;
 }/* if */
 if(cpress_lb)/* была эмуляция нажатия */
 {  cpress_lb=0;
    (*keys)=1;
    return;
 }/* if */
 if(cpress_rb)/* была эмуляция нажатия */
 {  cpress_rb=0;
    (*keys)=2;
    return;
 }/* if */
 (*keys)=inregs.x.bx;

}/* mouse_cpk */
/*--------------------------------------------------------------------------*/